S-March/smarchWatch_Public/Software/smarchWatch_DA14683/DA1468x_SDK_1.0.14.1081/DA1468x_DA15xxx_SDK_1.0.14.1081/sdk/interfaces/ble/src/stack/plf/black_orca/src/build/ble-full/reg/fw/reg_blecore.h
// field definitions
#define BLE_TYP_MASK     ((uint32_t)0xFF000000)
#define BLE_TYP_LSB      24
#define BLE_TYP_WIDTH    ((uint32_t)0x00000008)
#define BLE_REL_MASK     ((uint32_t)0x00FF0000)
#define BLE_REL_LSB      16
#define BLE_REL_WIDTH    ((uint32_t)0x00000008)
#define BLE_UPG_MASK     ((uint32_t)0x0000FF00)
#define BLE_UPG_LSB      8
#define BLE_UPG_WIDTH    ((uint32_t)0x00000008)
#define BLE_BUILD_MASK   ((uint32_t)0x000000FF)
#define BLE_BUILD_LSB    0
#define BLE_BUILD_WIDTH  ((uint32_t)0x00000008)

#define BLE_TYP_RST      0x7
#define BLE_REL_RST      0x0
#define BLE_UPG_RST      0x18
#define BLE_BUILD_RST    0x0

__STATIC_INLINE void ble_version_unpack(uint8_t* typ, uint8_t* rel, uint8_t* upg, uint8_t* build)
{
    uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);

    *typ = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *rel = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *upg = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *build = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_INLINE uint8_t ble_typ_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__STATIC_INLINE uint8_t ble_rel_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__STATIC_INLINE uint8_t ble_upg_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__STATIC_INLINE uint8_t ble_build_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief RWBLECONF register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:24            ADD_WIDTH   0xD
 *  22:16                 RFIF   0x1
 *  13:08              CLK_SEL   0xD
 *     06             DECIPHER   1
 *     05               DMMODE   0
 *     04              INTMODE   1
 *     03                 COEX   1
 *     02               USEDBG   1
 *     01             USECRYPT   1
 *     00             BUSWIDTH   0
 * </pre>
 */
#define BLE_RWBLECONF_ADDR   0x40000008
#define BLE_RWBLECONF_OFFSET 0x00000008
#define BLE_RWBLECONF_INDEX  0x00000002
#define BLE_RWBLECONF_RESET  0x0D010D5E

__STATIC_INLINE uint32_t ble_rwbleconf_get(void)
{
    return REG_BLE_RD(BLE_RWBLECONF_ADDR);
}

// field definitions
#define BLE_ADD_WIDTH_MASK   ((uint32_t)0x3F000000)
#define BLE_ADD_WIDTH_LSB    24
#define BLE_ADD_WIDTH_WIDTH  ((uint32_t)0x00000006)
#define BLE_RFIF_MASK        ((uint32_t)0x007F0000)
#define BLE_RFIF_LSB         16
#define BLE_RFIF_WIDTH       ((uint32_t)0x00000007)
#define BLE_CLK_SEL_MASK     ((uint32_t)0x00003F00)
#define BLE_CLK_SEL_LSB      8
#define BLE_CLK_SEL_WIDTH    ((uint32_t)0x00000006)
#define BLE_DECIPHER_BIT     ((uint32_t)0x00000040)
#define BLE_DECIPHER_POS     6
#define BLE_DMMODE_BIT       ((uint32_t)0x00000020)
#define BLE_DMMODE_POS       5
#define BLE_INTMODE_BIT      ((uint32_t)0x00000010)
#define BLE_INTMODE_POS      4
#define BLE_COEX_BIT         ((uint32_t)0x00000008)
#define BLE_COEX_POS         3
#define BLE_USEDBG_BIT       ((uint32_t)0x00000004)
#define BLE_USEDBG_POS       2
#define BLE_USECRYPT_BIT     ((uint32_t)0x00000002)
#define BLE_USECRYPT_POS     1
#define BLE_BUSWIDTH_BIT     ((uint32_t)0x00000001)
#define BLE_BUSWIDTH_POS     0

#define BLE_ADD_WIDTH_RST    0xD
#define BLE_RFIF_RST         0x1
#define BLE_CLK_SEL_RST      0xD
#define BLE_DECIPHER_RST     0x1
#define BLE_DMMODE_RST       0x0
#define BLE_INTMODE_RST      0x1
#define BLE_COEX_RST         0x1
#define BLE_USEDBG_RST       0x1
#define BLE_USECRYPT_RST     0x1
#define BLE_BUSWIDTH_RST     0x0

__STATIC_INLINE void ble_rwbleconf_unpack(uint8_t* addwidth, uint8_t* rfif, uint8_t* clksel, uint8_t* decipher, uint8_t* dmmode, uint8_t* intmode, uint8_t* coex, uint8_t* usedbg, uint8_t* usecrypt, uint8_t* buswidth)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);

    *addwidth = (localVal & ((uint32_t)0x3F000000)) >> 24;
    *rfif = (localVal & ((uint32_t)0x007F0000)) >> 16;
    *clksel = (localVal & ((uint32_t)0x00003F00)) >> 8;
    *decipher = (localVal & ((uint32_t)0x00000040)) >> 6;
    *dmmode = (localVal & ((uint32_t)0x00000020)) >> 5;
    *intmode = (localVal & ((uint32_t)0x00000010)) >> 4;
    *coex = (localVal & ((uint32_t)0x00000008)) >> 3;
    *usedbg = (localVal & ((uint32_t)0x00000004)) >> 2;
    *usecrypt = (localVal & ((uint32_t)0x00000002)) >> 1;
    *buswidth = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_INLINE uint8_t ble_add_width_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x3F000000)) >> 24);
}

__STATIC_INLINE uint8_t ble_rfif_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x007F0000)) >> 16);
}

__STATIC_INLINE uint8_t ble_clk_sel_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x00003F00)) >> 8);
}

__STATIC_INLINE uint8_t ble_decipher_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__STATIC_INLINE uint8_t ble_dmmode_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__STATIC_INLINE uint8_t ble_intmode_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__STATIC_INLINE uint8_t ble_coex_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__STATIC_INLINE uint8_t ble_usedbg_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__STATIC_INLINE uint8_t ble_usecrypt_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_INLINE uint8_t ble_buswidth_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_RWBLECONF_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief INTCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     15          CSCNTDEVMSK   1
 *     09             SWINTMSK   0
 *     08      EVENTAPFAINTMSK   1
 *     07      FINETGTIMINTMSK   0
 *     06     GROSSTGTIMINTMSK   0
 *     05          ERRORINTMSK   0
 *     04          CRYPTINTMSK   1
 *     03          EVENTINTMSK   1
 *     02            SLPINTMSK   1
 *     01             RXINTMSK   1
 *     00          CSCNTINTMSK   1
 * </pre>
 */
#define BLE_INTCNTL_ADDR   0x4000000C
#define BLE_INTCNTL_OFFSET 0x0000000C
#define BLE_INTCNTL_INDEX  0x00000003
#define BLE_INTCNTL_RESET  0x0000811F

__STATIC_INLINE uint32_t ble_intcntl_get(void)
{
    return REG_BLE_RD(BLE_INTCNTL_ADDR);
}

__STATIC_INLINE void ble_intcntl_set(uint32_t value)
{
    REG_BLE_WR(BLE_INTCNTL_ADDR, value);
}

